You may also find it easier to import Series and DataFrame into the local namespace since they are so frequently used

In [1]:
import pandas as pd
from pandas import Series, DataFrame

# Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse structures:
Series and DataFrame
While they are not a universal solution for every problem, they provide a solid, easy-to-use basis for most applications.

#### Series

Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively shows the index on the left and the values on the right. Since we did not specify an index for the data, a default one consisting of the integers 0 through N-1 (where N is the length of the data) is created

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index # lie range(4)

RangeIndex(start=0, stop=4, step=1)

# Can pandas series contain multiple data types?

The Pandas Series can be defined as a one-dimensional array that is capable of storing various data types. We can easily convert the list, tuple, and dictionary into series using "series 'method. The row labels of a series are called the index. A series CANNOT contain multiple columns.

In [6]:
obj2 = pd.Series([4, 5, -5, 3], index =['d', 'b', 'a', 'c'])
obj2
print(obj2.index)
print(obj2)

Index(['d', 'b', 'a', 'c'], dtype='object')
d    4
b    5
a   -5
c    3
dtype: int64

Often it will be desirable to create a Series with an index identifying each data point with a lable

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Compared with NumPy arrays, you can use labels in the index when selecting single values or a set of values:

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6

In [12]:
obj2[['c', 'a', 'd']] 
#Here ['c', 'a', 'd'] is interpreted as a list of indices
#event though it contains strings instead of integers

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

Another way to think about a Series is as a fixed-length, ordered dictionary object (dict), as it is a mapping of index values to data values. It can be used in many contexts where you might use a dict. 
Should you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
obj3 = pd.Series(sdata)

In [18]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

When you are only passing a dict, the index in the resulting Series will have the dict's keys in sorted order. You can override this by passing the dict keys in the order you want them to appear in the resulting Series.

In [19]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [20]:
obj4 = pd.Series(sdata, index=states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Here(the cell right above) three values found in sdata were placed in the appropriate locations, but since no value for 'California' was found, it appears as NaN (not a number), which is considered in pandas to mark missing or NA values. Since 'Utah' was not included in states, it is excluded from the resulting object.

I will use the terms "missing" or "NA" interchangeably to refer to missing data. The isnull and notnull functions in pandas should be used to detect missing data

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods:

In [24]:
obj4.isnull()
#I discuss working with missing data in more detail
#in Chapter 7.

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A usefule Series feature for many applications is that it automatically aligns by index label in arithmetic operations:

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Data alignment features will be addressed in more detail later. If you have experience with databases, you can think about this as being similar to a join operation.

# Sort a Pandas Series in Python

In [28]:
import pandas as pd
#define a numeric series
s = pd.Series([100, 200, 54.67, 300.12, 400])
#print the unsorted series
print(s)
sorted_series = s.sort_values(ascending = True)
# print the sorted series
sorted_series

0    100.00
1    200.00
2     54.67
3    300.12
4    400.00
dtype: float64

2     54.67
0    100.00
1    200.00
3    300.12
4    400.00
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with other key areas of pandas functionality:

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

A Series's index can be altered in-place by assignment:

In [33]:
obj.index=['Bob', 'Steve', 'Jeff', 'Ryan']

# DataFrame

#### A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).
#### The DataFrame has both a row and a colum index.
it can be though of as a dict of Series all sharing the same index. Under the hood, the data is stored as one or more two-dimensional blocks rather than a list, dict, or some other collection of one-dimensional arrays. The exact details of DataFrame's internals are outside the scope of this book.

# Pandas DataFrame

##### Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file. Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc.

There are many ways to construct a DataFrame, though one of the most common is from a dict of equal-length lists of NumPy arrays:

In [34]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

The resulting DataFrame will have its index assigned automatically as with Series. If you are using the Jupyter notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table.

For large DataFrames, the head method selects only the first five rows:

In [35]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Reading existing data using pandas- an example of reading data

In [37]:
#importing pandas package
import pandas as pd

#making data frame from csv file
data  = pd.read_csv("Temp-Data.csv")
print(data)
pd.DataFrame(data)

FileNotFoundError: [Errno 2] No such file or directory: 'Temp-Data.csv'

If you specify a sequence of columns, the DataFrame's columns will be arranged in that order:

In [ ]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

# DataFrame - creation of DataFrame with data, columns, and index

In [ ]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':[2000, 2001, 2002, 2001, 2002, 2003],
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, 
                    columns = ['year', 'state', 'pop'],
                    index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [ ]:
frame

If you pass a column that isn't contained in the dict, it will appear with missing values in the result:

In [ ]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [ ]:
frame2['state']

In [ ]:
frame2.year

#### Rows can also be retrieved by position or name with the special loc attribute 
much more on this later

In [38]:
frame2.loc['three']

NameError: name 'frame2' is not defined

Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values:

In [39]:
frame2['debt'] = 16.5

NameError: name 'frame2' is not defined

In [40]:
frame2

NameError: name 'frame2' is not defined

When you are assigning lists of arrays to a column. the value's length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame's index.

# DataFrame - delete columns

Assigning a column that doesn't exist will create a new column. The del keyword will delete columns as with a dict. As an example of del, I first add a new column of boolean values where the state column equals 'Ohio':

In [41]:
frame2['eastern'] = frame2.state == 'Ohio'

NameError: name 'frame2' is not defined

In [42]:
frame2

NameError: name 'frame2' is not defined

In [43]:
del frame2['eastern']

NameError: name 'frame2' is not defined

In [44]:
frame2.columns

NameError: name 'frame2' is not defined

# DataFrame - nested dict of dicts

Another common form of data is a nested dict of dicts:

In [45]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices:

In [46]:
frame3 = pd.DataFrame(pop)

In [47]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [48]:
frame3.sort_index()

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

# DataFrame - transpose

In [49]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

# DataFrame - showing index and column name

If a DataFrame's index and columns have their name attributes set, these will also be displayed:

In [50]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [51]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

2D ndarray: A matrix of data, passing optional row and column labels
dict of arrys, lists, or tuples: Each sequence becomes a column in the DataFrame; all sequences must be the same length
NumPy structured/record array: Treated as the "dict of arrays" case
dict of Series: Each value becomes a column; indexes from each Series are unioned together to form the result's row index if no explicit index is passed
dict of dicts: Each inner dict becomes a column; keys are unioned to form the row index as in the "dict of Series" case
List of dicts or Series: Each item becomes a row in the DataFrame; union of dict keys or Series indexes become the DataFrame's column labels
List of lists or tuples: Treated as the "2D ndarray" case
Another DataFrame: The DataFrame's indexes are used unless different ones are passed
NumPy MaskedArray: Like the "2D ndarray" case except masked values become NA/missing in the DataFrame result

# Index Objects

panda's Index objects are responsible for holding the axis labels and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index:

In [52]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [53]:
index = obj.index

In [54]:
index

Index(['a', 'b', 'c'], dtype='object')

In [55]:
index[1:]

Index(['b', 'c'], dtype='object')

# Index Objects

Immutability makes it safer to share Index objets among data structures:

In [56]:
import numpy as np
labels = pd.Index(np.arange(3))

In [57]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [58]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [59]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [60]:
obj2.index is labels

True

In [61]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [62]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [63]:
'Ohio' in frame3.columns

True

In [64]:
2003 in frame3.index

False

append: Concatenate with additional Index objects, producing a new index
difference: Compute set difference as an index
intersection: Compute set intersection
union: Compute set union
isin: Compute boolean array indicating whether each value is contained in the passed collection. 
delete: Compute new index sith element at index i deleted
drop: Compute new index by deleting passed values
insert: Compute new Index by inserting element at index i
is_monotonic: Returns True if each element is greater than or equal to the previous element
is_unique: Returns True if the Index has no duplicate values
unique: Compute the array of unique values in the Index

#  Essential Functionality

This section will walk you through the fundamental mechanics of interacting with the data contained in a Series or DataFrame. In the chapters to come, we will delve more deeply into data analysis and manipulation topics using pandas.

# Essential Functionality - Reindexing

An important method on pandas objects is reindex, which means to create a new object with the data conformed to a new index. Consider an example:

In [65]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [66]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [67]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [68]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a mthod such as ffill, which forward-fills the values:

In [69]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

In [70]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [71]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

# What is ffill and bfill

In [72]:
df = pd.DataFrame({"A" : [None, 1, 2, 3, None, None],
                  "B": [11, 5, None, None, None, 8],
                  "C": [None, 5, 10, 11, None, 8]})
print(df)

     A     B     C
0  NaN  11.0   NaN
1  1.0   5.0   5.0
2  2.0   NaN  10.0
3  3.0   NaN  11.0
4  NaN   NaN   NaN
5  NaN   8.0   8.0

In [73]:
print(df.ffill(axis = 0))

     A     B     C
0  NaN  11.0   NaN
1  1.0   5.0   5.0
2  2.0   5.0  10.0
3  3.0   5.0  11.0
4  3.0   5.0  11.0
5  3.0   8.0   8.0

In [74]:
print(df.bfill(axis = 0))

     A     B     C
0  1.0  11.0   5.0
1  1.0   5.0   5.0
2  2.0   8.0  10.0
3  3.0   8.0  11.0
4  NaN   8.0   8.0
5  NaN   8.0   8.0

In [75]:
print(df.bfill(axis=1))

      A     B     C
0  11.0  11.0   NaN
1   1.0   5.0   5.0
2   2.0  10.0  10.0
3   3.0  11.0  11.0
4   NaN   NaN   NaN
5   8.0   8.0   8.0

With DataFrame, reindex can alter either the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result:

In [76]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                     index = ['a', 'c', 'd'], 
                     columns = ['Ohio', 'Texas', 'California'])

In [77]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [78]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [79]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

index: New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An Index will be used exactly as is without any copying. 
method: Interpolation (fill) method; 'ffill' fills forward, while 'bfill' fills backward.
fill_value: Substitute value to use when introducing missing data by reindexing. 
limit: When forward-or backfilling, maximum size gap (in number of elements) to fill.
tolerance: When forward-or backfilling, maximum size gap (in absolute numeric distance) to fill for inexact matches.
level: Match simple index on level of MultiIndex; otherwise select subset of.
copy: If True, always copy underlying data even if new index is equivalent to old index; if False, do not copy the data when the indexes are equivalent

# Essential Functionality - Dropping Entries from an Axis

Dropping one or more entries from an axis is easy if you already have an index array or list without those entries. As that can require a bit of mungling and set logic, the drop method will return a new object with the indicated value or values deleted from an axis:

In [80]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [81]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [82]:
new_obj = obj.drop('c')

In [83]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [84]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:
Calling drop with a sequence of labels will drop values fro the row labels (axis 0)

In [85]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [86]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop values from the columns by passing axis=1 or axis='columns':

In [88]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [89]:
data.drop(['two', 'four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [90]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Essential Functionality - Indexing, Selection, and Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Serie's index values instead of only integers. Here are some examples of this:

In [91]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [92]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [93]:
obj['b']

1.0

In [94]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [95]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [96]:
obj[1]

1.0

In [97]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [98]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [99]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [100]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end point is inclusive:
Setting using these methods modifies the corresponding section of the Series

In [101]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [102]:
obj['b':'c'] = 5

In [103]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

#### Indexing into a DataFrame is for retrieving one or more columns either with  a single value or sequence:

In [104]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index =['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [105]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [107]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [108]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Another use cases is in indexing with a boolean DataFrame, such as one produced by a scalar comparison:

In [110]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

# Essential Functionality - Selection with loc and iloc

#### For DataFrame label-indexing on the rows, let's introduce the special indexing operators loc and iloc. They enable you to select a subset of the rows and columns from a DataFrame with NumPy like notation using either axis labels (loc) or integers (iloc).

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [113]:
display(data.loc['Colorado':'Utah', ['two', 'three']])

          two  three
Colorado    5      6
Utah        9     10

In [114]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [115]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [116]:
display(data.iloc[[1, 2], [3, 0, 1]])

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [117]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
display(data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
display(data.iloc[:, :3][data.three > 5])

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [119]:
display(data.iloc[:, :2][data.three > 6])

          one  two
Utah        8    9
New York   12   13

df[val] = Select single column or sequence of columns from the DataFrame; special case conveniences: boolean array (filter roes), slice (slice rows), or boolean DataFrame (set values based on some criterion)
df.loc[val] = Selects single row or subset of rows from the DataFrame by label
df.loc[:, val] = Selects single column or subset of columns by label.
df.loc[val1, val2] = Select both rows and columns by label
df.iloc[where] = Select single row or subset of rows from the DataFrame by integer position
df.iloc[:, where] = Select single column or subset of columns by integer position
df.iloc[where_i, where_j] = Select both rows and columns by integer position
df.at[label_i, label_j] = Select a single scalar value by row and column label
df.iat[i, j] Select a single scalar value by row and column position(integers)
reindex method = Select either rows or columns by labels
get_value, set_value methods = Select single value by row and column label

# Essential Functionality - Integer Indexes

Working with pandas objects indexed by integers is something that often trips up new users due to some differences with indexing semantics on built-in Python data structures like lists and tuples. For example, you might not expect the following code to generate an error:

In [120]:
ser = pd.Series(np.arange(3.))

In [121]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [122]:
ser[-1]

KeyError: -1

In this case, pandas could "fall back" on integer indexing, but it's difficult to do this in general without introducing subtle bugs. Here we have an index containing 0, 1, 2. but inferring what the user wants (label-based indexing or position-based) is difficult:

On the other hadn, with a non-integer index, there is no potential for ambiguity:

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [ ]:
ser2[-1]

# Essential Functionality Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic between objects with different index. When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs. For users with database experience, this is similar to an automatic outer join on the index lables. Let's look at an example:

In [123]:
s1= pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [124]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4.3, 3.1],
              index=['a', 'c', 'e', 'f', 'g'])

In [125]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

##

In [126]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.3
g    3.1
dtype: float64

In [127]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [128]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns = list('bcd'),
                  index = ['Ohio', 'Texas', 'Colorado'])

In [129]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [130]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [131]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [132]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Adding these together returns a DataFrame whose index and columns are the unions of the ones in each DataFrame

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear as all missing in the result. The same holds for the rows whose labels are not common to both objects.

If a DataFrame objects with no column or row lables in common, the result will contain all nulls:

In [133]:
df1 = pd.DataFrame({'A':[1, 2]})
df2 = pd.DataFrame({'B':[3, 4]})
display(df1)
display(df2)
df1 - df2

   A
0  1
1  2

   B
0  3
1  4

    A   B
0 NaN NaN
1 NaN NaN

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not

In [134]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
display(df1)
display(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

The add() function returns addition of dataframes, element-wise. Equivalent to dataframe + other, but with support to substitute a fill value for missing data in one of the inputs. In other words fill_value of 2 will replace all NaN with 2

In [135]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [136]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [137]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

For a listing of Series and DataFrame methods for arithmetic. Each of them has a counterpart, starting with the letter r, that has arguments flipped. So these two statements are equivalent:

In [138]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [139]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

add, radd = Methods for addition (+)
sub, rsub = Methods for subtraction (-)
div, rdiv = Methods for division (/)
floordiv, rfloordiv = Methods for floor division (//)
mul, rmul = Methods for multiplication (*)
pow, rpow = Methods for exponentiation (**)

The data is sorted in ascending order by default, but can be sorted in descending order, too:

In [140]:
frame.sort_index(axis=1, ascending=False)

   Texas  Ohio  California
a      1     0           2
c      4     3           5
d      7     6           8

In [141]:
obj=pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [142]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [143]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d','a','b', 'c'])

In [144]:
a = frame.sort_index()

In [145]:
a.sort_index(axis=1)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

To a sort a Series by its values, use its sort_values methods:

In [146]:
obj = pd.Series([4, 7, -3, 2])
display(obj)
obj.sort_values()

0    4
1    7
2   -3
3    2
dtype: int64

2   -3
3    2
0    4
1    7
dtype: int64

In [147]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [148]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

# Essential Functionality - Sorting and Ranking

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to the by option of sort_values:

In [149]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
display(frame)
frame.sort_values(by='b')

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank:

In [150]:
#importing pandas as pd
import pandas as pd

#Creating the Series
sr = pd.Series([10, 25, 3, 11, 24, 6])

#Create the Index
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp']

#set the index
sr.index = index_

#Print the series
print(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
dtype: int64

In [151]:
#assign rank
result = sr.rank()

#Print the result
print(result)

Coca Cola    3.0
Sprite       6.0
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
dtype: float64

In [152]:
#importing pandas as pd
import pandas as pd

#Creating the Series
sr = pd.Series([10, 25, 3, 11, 24, 6, 25])

#Create the Index
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp', 'Appy']

#set the index
sr.index = index_

#Print the series
print(sr)

#assign rank
result = sr.rank()

#Print the result
print(result)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
Appy         25
dtype: int64
Coca Cola    3.0
Sprite       6.5
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
Appy         6.5
dtype: float64

In [153]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2], 'a': [0,1,0,1], 'c': [-2, 5, 8, -2.5]})
display(frame)
display(frame.rank(axis='columns'))
display(frame.rank(axis='rows'))
display(frame.rank(axis='rows', method='first'))

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

# Essential Functionality - Axis Indexes with Duplicate Labels

Up until now all of the examples we've looked at have had unique axis labels (index values). While many pandas functions (like reindex) require that the labels be unique, it's not mandatory. Let's consider a small Series with duplicate indices:

In [154]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [155]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index's is_unique property can tell you whether its labels are unique or not:

In [156]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates. Indexing a label with multiple entries returns a Series, while single entries return a scalar value:

In [157]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [158]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [159]:
obj['a']

a    0
a    1
dtype: int64

In [160]:
obj['c']

4

This can make your code more complicated, as the output type from indexing can vary based on whether a label is repeated or not. The same logic extends to indexing rows in a DataFrame:

In [161]:
df = pd.DataFrame(np.random.rand(4, 3), index=['a', 'a', 'b', 'b'])

In [162]:
df

          0         1         2
a  0.247932  0.355535  0.388252
a  0.193407  0.403415  0.213292
b  0.622112  0.533807  0.746230
b  0.532873  0.531459  0.578851

In [163]:
df.loc['b']

          0         1         2
b  0.622112  0.533807  0.746230
b  0.532873  0.531459  0.578851

pandas objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reduction or summary statistics, methods that extract a single value (like the sum or mean) from a Series or a Series of values from the rows or columns of a DataFrame. Compared with the similar methods found on NumPy arrays, they have built-in handling for missing data.

In [164]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[1.4, np.nan], 
                  [7.1, -4.5],
                  [np.nan, np.nan], 
                  [0.75, -1.3]],
                 index =['a', 'b', 'c', 'd'], columns = ['one', 'two'])
display(df)
display(df.sum(axis=0))
display(df.sum(axis=1))

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [165]:
#importing pandas as pd
import pandas as pd

#Creating the dataframe
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                  "B":[5, 2, 52, 3, 2],
                  "C":[20, 16, 7, 3, 8],
                  "D":[14, 3, 17, 2, 6]})
# Print the dataframe
df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  52   7  17
3  44   3   3   2
4   1   2   8   6

In [166]:
#Eve n if we do not specify axis = 0, 
#The method will return the mean over
#the index axis by default
df.mean(axis=0)

A    13.2
B    12.8
C    10.8
D     8.4
dtype: float64

In [167]:
#importing pandas as pd
import pandas as pd

#Creating the dataframe
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                  "B":[7, 2, 54, 3, None],
                  "C":[20, 16, 11, 3, 8],
                  "D":[14, 3, None, 2, 6]})
print(df)
#skip the Na values while finding the mean
df.mean(axis=1, skipna = True)

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

In [168]:
#importing pandas as pd
import pandas as pd

#Creating the dataframe
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                  "B":[7, 2, 54, 3, None],
                  "C":[20, 16, 11, 3, 8],
                  "D":[14, 3, None, 2, 6]})
print(df)
#skip the Na values while finding the mean
df.mean(axis = 0, skipna = True)

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

A     5.50
B    16.50
C    11.60
D     6.25
dtype: float64

# Essential Functionality - Summarizing and Computing Descriptive Statistics

Another type of method is neither a reduction nor an accumulation. describe is one such example, producing multiple summary statistics in one shot:

In [169]:
df.describe()

               A         B          C          D
count   4.000000   4.00000   5.000000   4.000000
mean    5.500000  16.50000  11.600000   6.250000
std     4.654747  25.09316   6.655825   5.439056
min     1.000000   2.00000   3.000000   2.000000
25%     3.250000   2.75000   8.000000   2.750000
50%     4.500000   5.00000  11.000000   4.500000
75%     6.750000  18.75000  16.000000   8.000000
max    12.000000  54.00000  20.000000  14.000000

On non-numeric data, describe produces alternative summary statistics

In [170]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [171]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Method    Description
count = Number of non-NA values
describe = Compute set of summary statistics for Series or each DataFrame column
min, max = Compute minimum and maximum values
argmin, argmax = Compute index locations (integers) at which minimum or maximum value obtained, respectively
idxmin, idxmax = Compute index labels at which minimum or maximum value obtained, respectively
quantile = Compute sample quantile ranging from 0 to 1
sum = Sum of values
mean = Mean of values
median = Arithmetic median(50% quantile) of values
mad = Mean absolute deviation from mean value

# Essential Functionality - Unique Values, Value Counts, and Membership

Another class of related methods extracts information about the values cotained in a one-dimensional Series. To illustrate these, consider this example

In [172]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

The first function is unique, which gives you an array of the unique values in a Series:

In [173]:
uniques = obj.unique()

In [174]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies:

In [175]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [176]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

The Series is sorted by value in descending order as a convenience. value_counts is also available as a top-level pandas method that can be used with any array or sequence:

In [177]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64